Repository: xxsimoxx/post-to-telegram
Catalog: languages/ptt-*.po
Languages: it_it

source: <ol><li>Connect to BotFather and type <code>/newbot</code></li><li>Choose, when prompted, a name and a username for your bot.</li><li>BotFather will then answer with a token.</li><li>Add your new bot as an administrator of your channel.</li></ol>
it_it: <ol><li>Connettiti a BotFather e digita <code>/newbot</code></li><li>Quando richiesto scegli un nome ed un nome utente per il tuo bot.</li><li>BotFather risponder&agrave; con un token.</li><li>Aggiungi il bot creato come amministratore del tuo canale.</li></ol>

source: Channel
it_it: Canale

source: Channel (name or id) to post to.
it_it: Nome o ID del Canale su cui postare

source: Details:
it_it: Dettagli:

source: Dont't know what is your channel ID or something is not working?
it_it: Non conosci l'ID del canale o qualcosa non funziona?

source: Error sending to telegram channel.
it_it: Errore nell'invio al canale Telegram.

source: Instruction for creating a bot in Telegram
it_it: Istruzioni per creare un bot in Telegram

source: Last time posted:
it_it: Postato l'ultima volta:

source: Leave channel fiels blank to get suggestions below.
it_it: Lascia il campo Canale vuoto per avere suggerimenti qui sotto.

source: Message
it_it: Messaggio

source: No suggestion found. Try giving again your bot administration privileges in your channel.
it_it: Nessun suggerimento trovato. Prova a ridare ancora i permessi di amministratore del tuo canale al tuo bot.

source: Please check you bot token.
it_it: Per favore controlla il token del bot

source: Post to Telegram
it_it: Invia su Telegram

source: Post to Telegram settings
it_it: Impostazioni Post to Telegram

source: Prepend a message to article URL (Like "News on my site!").
it_it: Aggiungi un messaggio prima del link (Es. "E' uscito un nuovo articolo!")

source: Review your config before posting to Telegram.
it_it: Controlla la configurazione prima di postare su Telegram.

source: Secret token of the Bot you are using to post.
it_it: Token segreto del Bot che userai per postare su Telegram.

source: Seems that your bot is not an administrator of the channel.
it_it: Sembra che il tuo bot non sia amministratore del canale.

source: Settings have been saved.
it_it: Impostazioni salvate.

source: Share your posts to your telegram channel.
it_it: Condividi i tuoi articoli sul tuo canale Telegram

source: Your bot seems to be administrator of channel %1$s (Channel ID: %2$s).
it_it: Sembra che il tuo bot sia amministratore del canale %1$s (ID canale: %2$s).
